use Polyclinic_SWT611;
go

-- Заполнение таблиц базы данных Polyclinic
print('*** Старт скрипта заполнения таблиц ***')+char(13);

-- таблица персональных данных
print('*** данные таблицы справочника персональных данных ***');
insert People
    (Surname, [Name], Patronymic)
values
    ('Юрковский',   'Марк',      'Максимилианович'), /*  1 */
	('Якубовская',  'Диана',     'Павловна'),		/*  2 */
    ('Шапиро',      'Федор',     'Федорович'),     	/*  3 */
	('Вожжаев',     'Сергей',    'Денисович'),     	/*  4 */
    ('Хроменко',    'Игорь',     'Владимирович'),  	/*  5 */
	('Пелых',       'Марина',    'Ульяновна'),     	/*  6 */
	('Лапотникова', 'Тамара',    'Оскаровна'),     	/*  7 */
	('Огородников', 'Сергей',    'Иванович'),      	/*  8 */
    ('Яйло',        'Екатерина', 'Николаевна'),    	/*  9 */
	('Лосева',      'Инна',      'Степановна'),    	/* 10 */
    ('Михайлович',  'Анна',      'Валентиновна'),  	/* 11 */
	('Тарапата',    'Михаил',    'Исаакович'),     	/* 12 */
	('Трубихин',    'Эдуард',    'Михайлович'),    	/* 13 */
	('Чмыхало',     'Олег',      'Тарасович'),     	/* 14 */
	('Князьков',    'Степан',    'Сидорович'),     	/* 15 */
	('Потемкина',   'Наталья',   'Павловна'),      	/* 16 */
    ('Гритченко',   'Степан',    'Романович'),     	/* 17 */
	('Селиванов',   'Александр', 'Михайлович'),    	/* 18 */
	('Царькова',    'Лариса',    'Ильинична'),     	/* 19 */
	('Яструб',      'Владимир',  'Данилович'),     	/* 20 */
    ('Мелашенко',   'Александр', 'Алексеевич'),    	/* 21 */
	('Пономаренко', 'Владислов', 'Дмитриевич'),    	/* 22 */ 
	('Хавалджи',    'Любовь',    'Амировна'),      	/* 23 */
	('Пархоменко',  'Ирина',     'Владимировна'),  	/* 24 */
    ('Демидова',    'Алина',     'Александровна'), 	/* 25 */
	('Лысенко',     'Елена',     'Егоровна'),      	/* 26 */
	('Федосенко',   'Оксана',    'Владимировна'),  	/* 27 */
	('Богатырева',  'Екатерина', 'Алексеевна'),		/* 28 */
	('Иванова',     'Валентина', 'Степановна'),		/* 29 */
	('Ильюшин',     'Сергей',    'Юрьевич');		    /* 30 */
go

-- данные справочника врачебных специальностей
print(char(13) + '*** данные таблицы справочника врачебных специальностей ***');
insert Specialities
    ([Name])
values
    ('терапевт'),      /*  1 */    
	('стоматолог'),  	/*  2 */
	('окулист'),     	/*  3 */
	('кардиолог'),   	/*  4 */
	('пульманолог'), 	/*  5 */
	('хирург'),      	/*  6 */
	('акушер'),      	/*  7 */
	('отоларинголог'), /*  8 */     
	('инфекционист'),  /*  9 */    
	('физиотерпевт'),  /* 10 */    
	('онколог'),      	/* 11 */
	('венеролог'),     /* 12 */ 
	('уролог');      	/* 13 */
go


-- данные таблицы докторов, принимаем для удобства, что 
-- записи таблицы People 1, 15 относятся к докторам
print(char(13) + '*** данные таблицы докторов ***');
insert Doctors
    (PersonId, SpecialityId, Price, [Percent])
values
    ( 1, 1,  110, 5.0),  /*  1 */
	( 2, 2,  600, 3.0),	 /*  2 */
    ( 3, 1,  160, 3.5),	 /*  3 */
	( 4, 1,  250, 3.2),	 /*  4 */
    ( 5, 3,  300, 4.5),	 /*  5 */
	( 6, 2,  600, 4.5),	 /*  6 */
	( 7, 4,  300, 4.0),	 /*  7 */
	( 8, 5,  250, 3.5),	 /*  8 */
    ( 9, 6,  800, 5.1),	 /*  9 */
	(10, 6, 1300, 4.5),	 /* 10 */
    (11, 2,  350, 3.1),	 /* 11 */
	(12, 1,  120, 6.2);	 /* 12 */
go

-- данные таблицы пациентов
print(char(13) + '*** данные таблицы пациентов ***');
insert Patients  
    (PersonId, BornDate, [Address])
values                                                    
    (13, '12-02-2001', 'ул. Садовая, д. 123, кв. 12'),       /*  1 */
	(14, '09-07-1991', 'ул. Зайцева, д. 2'),				  /*  2 */
	(15, '18-03-1963', 'пр. Титова, д. 11, кв. 91'),		  /*  3 */
	(16, '21-04-1957', 'ул. Содовая, д. 9'),				  /*  4 */
    (17, '12-02-2001', 'ул. Челюскинцев, д. 112, кв. 211'),  /*  5 */
	(18, '01-06-1935', 'пр. Титова, д. 9, кв. 21'),		  /*  6 */
	(19, '06-07-1992', 'пл. Конституции, д. 3, кв. 75'),	  /*  7 */
	(20, '09-07-1991', 'пр. Мира, д. 3, кв. 64'),			  /*  8 */
    (21, '23-12-1947', 'ул. Содовая, д. 9, кв. 6'),		  /*  9 */
	(22, '09-07-1991', 'ул. Садовая, д. 10'),				  /* 10 */
	(23, '29-09-1956', 'ул. Судовая, д. 1, кв. 91'),		  /* 11 */
	(24, '13-04-1963', 'пр. Титова, д. 31, кв. 42'),		  /* 12 */
    (25, '21-04-1957', 'ул. Челюскинцев, д. 3'),			  /* 13 */
	(26, '12-02-2001', 'пр. Содовая, д. 13'),				  /* 14 */
	(27, '04-11-2001', 'пл. Конституции, д. 1, кв. 50'),	  /* 15 */
	(28, '09-10-2001', 'ул. Щорса, д. 23, кв. 17'),		  /* 16 */
	(29, '21-12-1998', 'ул. Овнатаняна, д. 4, кв. 98'),      /* 17 */
	(30, '27-02-1997', 'ул. Чкалова, д. 11');		          /* 18 */
go


-- данные таблицы врачебных приемов 
print(char(13) + '*** данные таблицы врачебных приемов ***');
insert Appointments
    (AppointmentDate, PatientId, DoctorId)
values
--    мм-дд-гг
    ('25-03-26',  6,  1),   /*  1 */
    ('25-03-26',  7,  1),	/*  2 */
    ('25-03-26',  7,  2),	/*  3 */
    ('26-03-26',  4,  3),	/*  4 */
    ('26-03-26',  4,  5),	/*  5 */
    ('26-03-26',  7,  5),	/*  6 */
    ('26-03-26',  8,  6),	/*  7 */
    ('27-03-26',  5,  2),	/*  8 */
    ('27-03-26',  6,  5),	/*  9 */
    ('28-03-26',  9,  6),	/* 10 */
    ('28-03-26',  7,  6),	/* 11 */
    ('29-03-26',  7,  7),	/* 12 */
    ('30-03-26',  6,  8),	/* 13 */
    ('30-03-26',  4,  9),	/* 14 */
    ('01-04-26',  6,  9),	/* 15 */
    ('01-04-26',  7,  1),	/* 16 */
    ('02-04-26',  8,  2),	/* 17 */
    ('02-04-26', 10,  2),	/* 18 */
    ('03-04-26',  5,  5),	/* 19 */
    ('03-04-26',  9,  7),	/* 20 */
    ('03-04-26',  6,  7);	/* 21 */
print(char(13) + '*** Финиш скрипта заполнения таблиц ***')
go
